Data scientists and programmers in q/kdb+ ([[https://code.kx.com/q4m3/][kdb+: world's fastest database; q: functional programming language of APL heritage]]) can leverage [[https://orgmode.org/worg/org-contrib/babel/][Babel]],  an existing Emacs framework for [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]] and [[https://en.wikipedia.org/wiki/Reproducibility#Reproducible_research][reproducible research]].

=ob-q= provides Org-Babel support for evaluating q source code within [[https://orgmode.org/worg/][.org documents]]. q source code blocks in Org Mode can be used to define functions, filter and analyze data, create graphics and figures, and produce reproducible research papers using a style similar to literate programming.

** Executing source code

Org captures the results of the source code block evaluation and inserts them in the Org file, right after the source code block. https://www.gnu.org/software/emacs/manual/html_node/org/Evaluating-code-blocks.html#Evaluating-code-blocks

If =:session= argument is not provided, one possible execution strategy is to pipe the string into a fresh invocation of q program. See =org-babel-eval= and https://stackoverflow.com/questions/10405461/org-babel-new-language

If =:results value= is provided:
#+BEGIN_SRC shell
echo -e -n "1+1\na:1\nb:2\na+b" | q
#+END_SRC

#+RESULTS:
: 2

If =:results value= is provided, append =\n= to the string so that intermediate results are printed:
#+BEGIN_SRC shell
echo -e -n "1+1\na:1\nb:2\na+b\n" | q
#+END_SRC

#+RESULTS:
: 2
: 3

